# <center><u>Data Cleaning</u></center>

 Data cleaning is a part of the process on a data science project.
 
Data cleaning is the process of fixing or removing incorrect, corrupted, incorrectly formatted, duplicate, or incomplete data within a dataset.
<br>
When you clean your data, all outdated or incorrect information is gone – leaving you with the highest quality information for your analysis and model building.

<p style='text-align: right;'> 4 points</p>

In [1]:
# import pandas and numpy with alias pd and np respectively
import pandas as pd
import numpy as np

Create a dataframe, d1 = pd.DataFrame( {‘Temperature’ : [1, np.nan, 3, 2, 3] ,’Humidity’ : [22, np.nan, 2 , np.nan, 20 ] })

In [2]:
d1 = pd.DataFrame( {'Temperature' : [1, np.nan, 3, 2, 3] ,'Humidity' : [22, np.nan, 2 , np.nan, 20 ] })

print the dataframe d1

In [3]:
d1

   Temperature  Humidity
0          1.0      22.0
1          NaN       NaN
2          3.0       2.0
3          2.0       NaN
4          3.0      20.0

Find whether the given dataframe contain any missing values?

In [4]:
d1.isnull()

   Temperature  Humidity
0        False     False
1         True      True
2        False     False
3        False      True
4        False     False

How many missing values does each column have?

In [5]:
d1.isnull().sum(axis=0) #imp

Temperature    1
Humidity       2
dtype: int64

## Dealing with missing values

Refrence:-https://www.youtube.com/watch?v=xkRz6R0FlQ4

<br>Now, we know we have missing values, the next thing that we need to work on, is how to deal with these missing values

 - ## Method 1: Delete the rows which contain missing values.
 This method include dropping all the rows that have missing value in any column.

 <p style='text-align: right;'> 20 points</p>

Use a suitable method to drop all the rows having missing values and save the change in d2 variable

In [6]:
d2=d1.dropna()

Print d2

In [7]:
print (d2)

   Temperature  Humidity
0          1.0      22.0
2          3.0       2.0
4          3.0      20.0

Hey Remember : droping rows with nan is one of the method to deal with missing values. But you have to decide if you need to go for this method by checking percentage of nan present in the dataframe.

If a column is having more than 60% of nan values then its better to remove such variables altogether if business permits

- ## Method 2: Replacing missing values
Sometimes rather than dropping NA values, you'd rather replace them with a valid value. This value might be a single number like zero, or it might be some sort of imputation or interpolation

<p style='text-align: right;'> 30 points</p>

Impute the missing values with constant number of your choice

In [8]:
# The below output has imputed missing  values with 100
d1.fillna('100')
# d1.replace(np.nan,'100')
# print(type(d1.replace(np.nan,'100')))

  Temperature Humidity
0           1       22
1         100      100
2           3        2
3           2      100
4           3       20

Do you think its a  good way to treat Nan values? What if such constant values are not suitable for our further analysis?
Try to give your thoughts on this.

In [9]:
#no its not thr good way.

Impute the missing values with mean

In [10]:
# d1.replace(np.nan, {"Temperature":d1['Temperature'].mean(),"Humidity":d1['Humidity'].mean()})
d1.fillna({"Temperature":d1['Temperature'].mean(),"Humidity":d1['Humidity'].mean()})

   Temperature   Humidity
0         1.00  22.000000
1         2.25  14.666667
2         3.00   2.000000
3         2.00  14.666667
4         3.00  20.000000

Impute the missing values with median

In [11]:
# d1.replace(np.nan, {"Temperature":d1['Temperature'].median(),"Humidity":d1['Humidity'].median()})
d1.fillna({"Temperature":d1['Temperature'].median(),"Humidity":d1['Humidity'].median()})

   Temperature  Humidity
0          1.0      22.0
1          2.5      20.0
2          3.0       2.0
3          2.0      20.0
4          3.0      20.0

Replacing with the mean, mode or median approximations are a statistical approach of handling the missing values.

Another Fun fact:
    
    This is an approximation which can add variance to the data set. But the loss of the data can be negated by this method which yields better results compared to removal of rows and columns.

Impute Nan with forward fill

In [12]:
d1.ffill()

   Temperature  Humidity
0          1.0      22.0
1          1.0      22.0
2          3.0       2.0
3          2.0       2.0
4          3.0      20.0

Impute Nan with backward fill

In [13]:
d1.bfill()

   Temperature  Humidity
0          1.0      22.0
1          3.0       2.0
2          3.0       2.0
3          2.0      20.0
4          3.0      20.0

Hey a fun fact here, as sweet as a cookie:

- ffill/pad/bfill are good imputation method if our data is of time series. This would keep the trend unaffected for our analysis.

Impute nan using interpolation method

In [14]:
d1.interpolate()

   Temperature  Humidity
0          1.0      22.0
1          2.0      12.0
2          3.0       2.0
3          2.0      11.0
4          3.0      20.0

You lucky champ! you got to know another amazing fact:
 - Interpolation method by default is linear in nature. It is an imputation technique that assumes a linear relationship between data points and utilises non-missing values from adjacent data points to compute a value for a missing data point.


You can explore other techniques involved in interplolation method, which might be usefull for your project.

Perform KNN imputation

In [15]:
# Hint: Import KNNImputer and impute it on d1
from sklearn.impute import KNNImputer
imputer = KNNImputer(n_neighbors=2)
pd.DataFrame(imputer.fit_transform(d1))
# no idea of the concept behind this - please explain or help with some relevant videos 
#unable to get the header name

      0          1
0  1.00  22.000000
1  2.25  14.666667
2  3.00   2.000000
3  2.00  12.000000
4  3.00  20.000000

Point to ponder: KNN is an algorithm that is useful for matching a point with its closest k neighbors in a multi-dimensional space.

Do you think scaling is required to implement this method?. Yes you are right the answer is YES.
Can you comment below why normalized data is required, so that we understand your logic on this.

_what is scaling means - what do you mean by normalized data and what is KNN imputation for nan values

# Dropping Irrelevant Columns

Reference:-https://www.youtube.com/watch?v=cRurWEfmxC0

<p style='text-align: right;'> 5 points</p>

Create a dataframe df = pd.DataFrame(np.random.randint(0,100,size=(100, 5)), columns=list('ABCDE'))

In [16]:
df = pd.DataFrame(np.random.randint(0,100,size=(100, 5)), columns=list('ABCDE'))

print df

In [17]:
df.head()

    A   B   C   D   E
0  73  51  20  31  20
1   8  95  66  98  31
2   2  12  75  80  74
3  39  64  43  99  36
4  90  34   5   7  30

Note: Since all the rows are having random numbers, your dataframe observations might be different than the output given above

Suppose for our analysis our project do not require column E. So you need to remove this column. update this new change using inplace parameter

In [18]:
del df['E']

Check if column **E** is removed by printing head of df

In [19]:
print(df.head())
print(type(df))

    A   B   C   D
0  73  51  20  31
1   8  95  66  98
2   2  12  75  80
3  39  64  43  99
4  90  34   5   7
<class 'pandas.core.frame.DataFrame'>

# Ensure requirements as per domain

Reference:-https://www.youtube.com/watch?v=eM7p3MVLOZ8

<p style='text-align: right;'> 10 points</p>


Shallow copy the dataframe df in variable df2 and print df2 head

In [20]:
df2=df.copy(deep= False)
df2.head()

    A   B   C   D
0  73  51  20  31
1   8  95  66  98
2   2  12  75  80
3  39  64  43  99
4  90  34   5   7

Suppose your domain expert says to filter column B with even numbers to do correct analysis. Implement the same below and update the change in varaible df2.

In [21]:
df2=pd.DataFrame(df2[df2['B']%2==0])

print updated head of *df2*

In [22]:
df2.head()

    A   B   C   D
2   2  12  75  80
3  39  64  43  99
4  90  34   5   7
5   8  12  36  70
6  98  32  84  78

# Creating a sensible index values

Reference:-https://www.youtube.com/watch?v=FQ4IB5mZOmQ

Oops. The index in this dataframe doesn't make sense. please correct index in a sequential manner starting from 1. Save the updates in df2

In [23]:
df2.reset_index(drop= True, inplace = True)  # this is really very important - it takes a lot of time to undertand

print df2 head again

In [24]:
df2.head()

    A   B   C   D
0   2  12  75  80
1  39  64  43  99
2  90  34   5   7
3   8  12  36  70
4  98  32  84  78

# Renaming column names to meaningful names.

Reference:- https://www.youtube.com/watch?v=YnggjqAfZCU
<p style='text-align: right;'> 2 points</p>

Now df2 columns represents marks of the adventurous 'Anand', the brave 'Barkha', the compassionate 'Chandu' and the dashing 'Daniel'. Rename the columns with their name inplace of their first letter of their name.

In [25]:
df2.rename(columns={"A":"Anand","B":"Barkha", "C":"Chandu","D":"Daniel"}, inplace = True)

print df2 tail with updated column names

In [26]:
df2.head()

   Anand  Barkha  Chandu  Daniel
0      2      12      75      80
1     39      64      43      99
2     90      34       5       7
3      8      12      36      70
4     98      32      84      78

Yeah! now the data looks pretty meaningful to study

# Treating Duplicate Data

Reference: https://www.youtube.com/watch?v=bFVMR1qfzXo

<p style='text-align: right;'> 20 points</p>

Make another dataframe df3 by deep copying df2.

Reference:-https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.copy.html

In [27]:
df3=df2.copy()
df3.head()

   Anand  Barkha  Chandu  Daniel
0      2      12      75      80
1     39      64      43      99
2     90      34       5       7
3      8      12      36      70
4     98      32      84      78

Make another column in df3 with name 'dummy' having 0 as values
throughout the rows.

In [28]:
df3['dummy']=0
df3.head()

   Anand  Barkha  Chandu  Daniel  dummy
0      2      12      75      80      0
1     39      64      43      99      0
2     90      34       5       7      0
3      8      12      36      70      0
4     98      32      84      78      0

In [29]:
print(df.head())
print(df2.head())
print(df3.head())

    A   B   C   D
0  73  51  20  31
1   8  95  66  98
2   2  12  75  80
3  39  64  43  99
4  90  34   5   7
   Anand  Barkha  Chandu  Daniel
0      2      12      75      80
1     39      64      43      99
2     90      34       5       7
3      8      12      36      70
4     98      32      84      78
   Anand  Barkha  Chandu  Daniel  dummy
0      2      12      75      80      0
1     39      64      43      99      0
2     90      34       5       7      0
3      8      12      36      70      0
4     98      32      84      78      0

Hey buddy! Don't you think, there is some difference between copy operation used for creating df2 and df3.

If you think Yes, Then please comment below the difference

_ i didnt understns actually diff between these two nd use case

Print the tail of df3

In [30]:
df3.tail()

    Anand  Barkha  Chandu  Daniel  dummy
50     95      38      85      61      0
51     26      12      39      54      0
52     55      80      52      24      0
53      0      14      68      45      0
54     30      48       8      11      0

make an array name 'ListB' with values of column 'Barkha'

In [31]:
listB=np.array(df3['Barkha'])

Print ListB

In [32]:
listB

array([12, 64, 34, 12, 32, 24, 22, 40,  2, 46, 44, 10, 64, 68,  0, 68, 58,
       44, 42, 44, 60, 44, 36, 66, 64, 54, 10, 80, 52, 18,  6, 38, 24, 42,
       54, 58, 10, 38, 56, 48,  4, 30, 96, 28,  0, 80,  8, 56,  8,  0, 38,
       12, 80, 14, 48])

Assign this array values as another column in df3 with name 'Anonymous'

In [33]:
df3['Anonymous']=listB
df3.head()

   Anand  Barkha  Chandu  Daniel  dummy  Anonymous
0      2      12      75      80      0         12
1     39      64      43      99      0         64
2     90      34       5       7      0         34
3      8      12      36      70      0         12
4     98      32      84      78      0         32

Create a dataframe 'ListA' with values of row index 3, 10 and 50

In [34]:
ListA= pd.DataFrame(df3.iloc[[3,10,50]])

print ListA

In [35]:
ListA

    Anand  Barkha  Chandu  Daniel  dummy  Anonymous
3       8      12      36      70      0         12
10     69      44      12       3      0         44
50     95      38      85      61      0         38

Concat ListA to df ignoring the index values of ListA so that we can maintain the sequential index value thoughout the dataframe.

In [36]:
df3=pd.concat([ListA,df3],ignore_index = True, axis=0)  #selfnote -  very importtant never miss [] and axis = 0

print head of df3

In [37]:
df3.head()

   Anand  Barkha  Chandu  Daniel  dummy  Anonymous
0      8      12      36      70      0         12
1     69      44      12       3      0         44
2     95      38      85      61      0         38
3      2      12      75      80      0         12
4     39      64      43      99      0         64

Check if there is any duplicate rows present in the dataframe df3

In [38]:
df3[df3.duplicated()]  #self note - awesome things to see the duplicates

    Anand  Barkha  Chandu  Daniel  dummy  Anonymous
6       8      12      36      70      0         12
13     69      44      12       3      0         44
53     95      38      85      61      0         38

By above output it seems we do have duplicated rows in our dataset

Drop duplicated rows using pandas function keeping first values of such duplicated observations

In [39]:
df3.drop_duplicates(inplace= True)

Check again if we have any duplicate row values present

In [40]:
df3[df3.duplicated()]

Empty DataFrame
Columns: [Anand, Barkha, Chandu, Daniel, dummy, Anonymous]
Index: []

Yipeee!! Did you notice the dataframe is free from any duplicate rows now.

Drop any duplicate columns present in the dataframe df

In [41]:
df3 = df3.loc[:,~df3.columns.duplicated()] # isnt it asked here ?
df3.head()

   Anand  Barkha  Chandu  Daniel  dummy  Anonymous
0      8      12      36      70      0         12
1     69      44      12       3      0         44
2     95      38      85      61      0         38
3      2      12      75      80      0         12
4     39      64      43      99      0         64

Did you notice which Column is dropped?
I am sure you noticed it.
Name that column below

Column:____________ none of the columns-- please explain - i did nt get actually

# Treating constant column values

<p style='text-align: right;'> 2 points</p>

Check unique values in each columns

In [42]:
# print({'Anand':len(list(df3['Anand'].unique())),
#        'Barkha':len(list(df3['Barkha'].unique())),
#        'Chandu':len(list(df3['Chandu'].unique())),
#        'Daniel':len(list(df3['Daniel'].unique())),
#        'dummy':len(list(df3['dummy'].unique())),
#        'Anonymous':len(list(df3['Anonymous'].unique()))
#       })

#is there any easy way or iteration way to get these numbers or dict - please explain here ??///////////////

print(df3.nunique())  # later i came to know while searching on internet

Anand        42
Barkha       32
Chandu       44
Daniel       43
dummy         1
Anonymous    32
dtype: int64

By above output which column has only 1 value as unique throught the rows? 
Yeah! you are right, its dummy column.
So lets drop it

Drop dummy column as it has constant values which will not give us any information and save the changes to df3 using inplace parameter

In [43]:
df3.drop(['dummy'],inplace = True, axis = 1)   # need to under the concept of axis once more

print final obtained dataframe df3

In [44]:
df3

    Anand  Barkha  Chandu  Daniel  Anonymous
0       8      12      36      70         12
1      69      44      12       3         44
2      95      38      85      61         38
3       2      12      75      80         12
4      39      64      43      99         64
5      90      34       5       7         34
7      98      32      84      78         32
8       7      24      11      60         24
9      98      22      24      38         22
10     26      40      42      39         40
11     77       2      85      69          2
12     92      46      90       5         46
14     65      10      93      85         10
15     45      64       0      23         64
16     79      68      74       7         68
17     23       0      23      95          0
18     69      68      29      81         68
19     38      58      55      43         58
20     15      44      51      27         44
21     66      42      84      53         42
22     38      44      83      45         44
23     60      60      99      16         60
24     63      44      23      98         44
25     29      36      51      50         36
26     85      66      34      74         66
27     65      64      75      41         64
28     58      54      64      84         54
29     39      10      41      13         10
30     66      80      47      33         80
31     39      52      23      81         52
32     76      18      74      78         18
33     73       6      22      80          6
34     74      38      75      21         38
35     47      24      87      40         24
36     49      42       4      21         42
37     79      54      64      86         54
38     64      58      63      97         58
39     88      10       2      95         10
40     27      38      82      49         38
41      4      56      86      15         56
42     75      48      53      63         48
43     23       4      72       4          4
44     50      30      31      35         30
45     59      96      77      85         96
46      8      28      44      80         28
47     90       0      60      89          0
48     99      80      23      60         80
49     51       8      92       1          8
50     57      56      62       6         56
51     20       8      75      23          8
52     58       0      73      11          0
54     26      12      39      54         12
55     55      80      52      24         80
56      0      14      68      45         14
57     30      48       8      11         48

---------------------------------

# C'mon cheers:) you have completed the 5th milestone challenge too. 

--------------------------------

# FeedBack
We hope you’ve enjoyed this course so far. We’re committed to helping you use AIforAll course to its full potential so you can grow with us. And that’s why we need your help in form of a feedback here

We appreciate your time for your thoughtful comment below

Space to comment:

<br> nice set of questions - some more video refernce is required i think-

**Rate the following in the scale of 1 to 10**

Assignment Difficulty Level

**Rate**:8

Question Clarity Level

**Rate**: 8

YouTube video content quality.

**Rate** 10

-----------------------------------